OdGiSelectionGeomState.Dispose
\details
Destructor for the OdGiSelectionGeomState class. Resets geometry selection state.

OdGiSelectionGeomState.#ctor(OdGiSubEntityTraits*,System.Boolean)
\details
Constructor for the OdGiSelectionGeomState class.
Saves current geometry selection state and sets a new one.
\param pTraits  [in]  Sub-entity traits.
\param bOn      [in]  Selection state to set.